package hw.vpex.decode;

/**
 * Vadim Voronov
 * Created: 13-May-17.
 * email: vadim.v.voronov@gmail.com
 */
public class Decode {

//    Или может кто может дать готовый код. В теории вроде бы не очень сложно.
//1.Напишите процедуру, которая по заданному сообщению длиной получает кодовое слово, закодированное следующим -кодом:
// – код с повторениями;
//2. Напишите процедуру, которая декодирует заданный вектор длиной с использованием присущего заданному в п. 1 коду алгоритму декодирования.
//3. Напишите процедуру декодирования, которая декодирует заданный вектор длиной с использованием определенной таблицы смежных классов.
//4. Напишите процедуру, которая генерирует все возможные ошибки для заданного кодового слова, запускает любую из реализованных процедур декодирования и определяет, какое число ошибок каждой кратности было обнаружено и исправлено. Проведите анализ полученных результатов.
//5. Сравните результаты, выдаваемые реализованными процедурами декодирования.
//6. Определите время выполнения и объем используемой памяти для каждой из реализованных процедур декодирования.
//7. Сделайте выводы о достоинствах и недостатках исследованных кодов.
//8. Сделайте выводы о достоинствах и недостатках метода декодирования линейных двоичных кодов по лидеру смежного класса.
}
